[A_FrostBolt H7HeroAbility]
mTooltipMagicGuild="对目标敌方单位造成 %d.icon 水系伤害，立即生效。"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %d.icon"
mTooltipUpgraded="对目标敌方单位立即造成 %d.min 到 %d.max %d.icon 水系伤害，并且其 %buff.buff.stat.icon 移动力减少 %buff.buff.stat.norm，持续 %buff.buff.durini 回合。"
mName="霜冻箭矢"
mTooltip="对目标敌方单位立即造成 %d.min 到 %d.max %d.icon 水系伤害。"

[A_heal_immunity H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔法免疫"
mTooltip="该生物无法成为任何魔法学派负面法术或效果的目标。来自敌方攻击的所有魔法伤害减半。"

[A_Nova H7HeroAbility]
mTooltipMagicGuild="对打击线上的所有单位造成 %d.icon 水系伤害，随后有30%的几率冻结它们。"
mTooltipMagicGuildRankLine="%d.min 到 %d.max %d.icon"
mTooltipUpgraded="对打击区域内的单位造成 %d.min 到 %d.max %d.icon 水系伤害，并有60%的几率冻结它们。"
mName="冰枪术"
mTooltip="对打击区域内的单位造成 %d.min 到 %d.max %d.icon 水系伤害，并有30%的几率冻结它们。"